Documents/ВводПоказанийПриборовОтопление.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ВводПоказанийПриборовОтопление</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РасчетПоказанийПриборовОтопление</xr:Item>
				<xr:Item>AccumulationRegister.РасчетПоказанийПриборовУчета</xr:Item>
				<xr:Item>InformationRegister.ПоказанияПриборовУчета</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПриборыУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПриборУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредыдущиеПоказания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущиеПоказания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КвоКубов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидТарифа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Источник</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИсточникиПоказаний</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредварительныйРассчет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/РасчетПоказанийПриборовУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетПоказанийПриборовУчета</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектУстановки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидТарифа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КорректировкаПоказаний</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Энергоемкость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ВводПоказанийПриборовВоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ВводПоказанийПриборовВоды</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РасчетПоказанийПриборовУчета</xr:Item>
				<xr:Item>InformationRegister.ПоказанияПриборовУчета</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПриборыУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПриборУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредыдущиеПоказания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущиеПоказания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КвоКубов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидТарифа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Источник</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИсточникиПоказаний</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредварительныйРассчет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ВводПоказанийПриборовОтопление/Ext/ManagerModule.bsl
// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицуРасчетПоказанийПриборовУчета(ДокументСсылкаВводПоказанийПриборовУчета, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	ВременнаяТаблицаПоказанияПриборовУчета.Период,
		|	ВременнаяТаблицаПоказанияПриборовУчета.ПриборУчета КАК ПриборУчета,
		|	ВременнаяТаблицаПоказанияПриборовУчета.ОбъектУстановки КАК ОбъектУстановки,
		|	ВременнаяТаблицаПоказанияПриборовУчета.Услуга КАК Услуга,
		|	ВременнаяТаблицаПоказанияПриборовУчета.ВидТарифа КАК ВидТарифа,
		|	ВременнаяТаблицаПоказанияПриборовУчета.КвоКубов КАК Значение
		|ИЗ
		|	ВременнаяТаблицаПоказанияПриборовУчета КАК ВременнаяТаблицаПоказанияПриборовУчета
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		|	ВременнаяТаблицаПоказанияПриборовУчета.Период,
		|	ВременнаяТаблицаПоказанияПриборовУчета.ПриборУчета,
		|	ВременнаяТаблицаПоказанияПриборовУчета.ОбъектУстановки,
		|	УслугиСоставныеУслуги.Услуга,
		|	ВременнаяТаблицаПоказанияПриборовУчета.ВидТарифа,
		|	ВременнаяТаблицаПоказанияПриборовУчета.КвоКубов
		|ИЗ
		|	ВременнаяТаблицаПоказанияПриборовУчета КАК ВременнаяТаблицаПоказанияПриборовУчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Услуги.СоставныеУслуги КАК УслугиСоставныеУслуги
		|		ПО ВременнаяТаблицаПоказанияПриборовУчета.Услуга = УслугиСоставныеУслуги.Ссылка
		|ГДЕ
		|	УслугиСоставныеУслуги.Услуга <> ЗНАЧЕНИЕ(Справочник.Услуги.ПустаяСсылка)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетПоказанийПриборовУчета", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицуРасчетПоказанийПриборовУчета()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицуПоказанияПриборовУчета(ДокументСсылкаВводПоказанийПриборовУчета, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВременнаяТаблицаПоказанияПриборовУчета.Период КАК Период,
		|	ВременнаяТаблицаПоказанияПриборовУчета.ПриборУчета КАК ПриборУчета,
		|	ВременнаяТаблицаПоказанияПриборовУчета.ВидТарифа КАК ВидТарифа,
		|	ВременнаяТаблицаПоказанияПриборовУчета.ТекущиеПоказания КАК Значение,
		|	ВременнаяТаблицаПоказанияПриборовУчета.Источник
		|ИЗ
		|	ВременнаяТаблицаПоказанияПриборовУчета КАК ВременнаяТаблицаПоказанияПриборовУчета";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПоказанияПриборовУчета", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицуДенежныеСредства()

Процедура СформироватьТаблицуЗаданийНаСнятиеПоказанийПриборовУчета(ДокументСсылкаВводПоказанийПриборовУчета, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
    Запрос.Текст = "ВЫБРАТЬ
                   |	ВременнаяТаблицаПоказанияПриборовУчета.Ответственный,
                   |	ВременнаяТаблицаПоказанияПриборовУчета.Здание,
				   //|	ВременнаяТаблицаПоказанияПриборовУчета.ОбъектЛицевогоСчета,
                   |	ВременнаяТаблицаПоказанияПриборовУчета.ПриборУчета,
				   //|	ВременнаяТаблицаПоказанияПриборовУчета.ГраничнаяДатаСъема,
                   |	&Период
                   |ИЗ
                   |	ВременнаяТаблицаПоказанияПриборовУчета КАК ВременнаяТаблицаПоказанияПриборовУчета";
				   
	Запрос.УстановитьПараметр("Период",ТекущаяДата());
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗаданияНаСнятиеПоказаний", РезультатЗапроса.Выгрузить());

	
КонецПроцедуры


Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаВводПоказанийПриборовВоды, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 
		 "ВЫБРАТЬ
		 |	ВводПоказанийПриборовВодыПриборыУчета.Услуга,
		 |	ВводПоказанийПриборовВодыПриборыУчета.ПриборУчета,
		 |	ВводПоказанийПриборовВодыПриборыУчета.Ссылка.ЛицевойСчет КАК ОбъектУстановки,
		 |	ВводПоказанийПриборовВодыПриборыУчета.ВидТарифа,
		 |	КОНЕЦПЕРИОДА(ВводПоказанийПриборовВодыПриборыУчета.Ссылка.ПериодНачисления, МЕСЯЦ) КАК Период,
		 |	ВводПоказанийПриборовВодыПриборыУчета.ТекущиеПоказания,
		 |	ВводПоказанийПриборовВодыПриборыУчета.ПредыдущиеПоказания,
		 |	ВводПоказанийПриборовВодыПриборыУчета.КвоКубов,
		 |	ВводПоказанийПриборовВодыПриборыУчета.Ссылка.Ответственный,
		 //|	ВводПоказанийПриборовУчетаОсновная.ОбъектЛицевогоСчета,
		 |	ВводПоказанийПриборовВодыПриборыУчета.Ссылка.Здание,
		 |	ВводПоказанийПриборовВодыПриборыУчета.Источник
		 |ПОМЕСТИТЬ ВременнаяТаблицаПоказанияПриборовУчета
		 |ИЗ
		 |	Документ.ВводПоказанийПриборовВоды.ПриборыУчета КАК ВводПоказанийПриборовВодыПриборыУчета
		 |ГДЕ
		 |	ВводПоказанийПриборовВодыПриборыУчета.Ссылка = &Ссылка";
	 
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаВводПоказанийПриборовВоды);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СформироватьТаблицуРасчетПоказанийПриборовУчета(ДокументСсылкаВводПоказанийПриборовВоды, СтруктураДополнительныеСвойства);
	СформироватьТаблицуПоказанияПриборовУчета(ДокументСсылкаВводПоказанийПриборовВоды, СтруктураДополнительныеСвойства);
	СформироватьТаблицуЗаданийНаСнятиеПоказанийПриборовУчета(ДокументСсылкаВводПоказанийПриборовВоды, СтруктураДополнительныеСвойства);
КонецПроцедуры


// Выполняет контроль повторного начисления.
//
Процедура ВыполнитьКонтрольПовторногоНачисления(ДокументСсылкаВводПоказанийПриборовВоды, ДополнительныеСвойства, Отказ, УдалениеПроведения = Ложь) Экспорт
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	Если СтруктураВременныеТаблицы.ДвиженияРасчетПоказанийПриборовУчетаИзменение Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РасчетПоказанийПриборовУчетаОбороты.Регистратор КАК Регистратор
		|ИЗ
		|	ДвиженияРасчетПоказанийПриборовУчетаИзменение КАК ДвиженияРасчетПоказанийПриборовУчетаИзменение
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетПоказанийПриборовУчета.Обороты(
		|				&ДатаНачала,
		|				&ДатаОкончания,
		|				Регистратор,
		|				(ОбъектУстановки, ПриборУчета, Услуга, ВидТарифа) В
		|					(ВЫБРАТЬ
		|						ДвиженияРасчетПоказанийПриборовУчетаИзменение.ОбъектУстановки КАК ОбъектУстановки,
		|						ДвиженияРасчетПоказанийПриборовУчетаИзменение.ПриборУчета КАК ПриборУчета,
		|						ДвиженияРасчетПоказанийПриборовУчетаИзменение.Услуга КАК Услуга,
		|						ДвиженияРасчетПоказанийПриборовУчетаИзменение.ВидТарифа КАК ВидТарифа
		|					ИЗ
		|						ДвиженияРасчетПоказанийПриборовУчетаИзменение КАК ДвиженияРасчетПоказанийПриборовУчетаИзменение)) КАК РасчетПоказанийПриборовУчетаОбороты
		|		ПО ДвиженияРасчетПоказанийПриборовУчетаИзменение.ОбъектУстановки = РасчетПоказанийПриборовУчетаОбороты.ОбъектУстановки
		|			И ДвиженияРасчетПоказанийПриборовУчетаИзменение.ПриборУчета = РасчетПоказанийПриборовУчетаОбороты.ПриборУчета
		|			И ДвиженияРасчетПоказанийПриборовУчетаИзменение.Услуга = РасчетПоказанийПриборовУчетаОбороты.Услуга
		|			И ДвиженияРасчетПоказанийПриборовУчетаИзменение.ВидТарифа = РасчетПоказанийПриборовУчетаОбороты.ВидТарифа
		|ГДЕ
		|	РасчетПоказанийПриборовУчетаОбороты.Регистратор <> &Ссылка");
		
		Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаВводПоказанийПриборовВоды);
		Запрос.УстановитьПараметр("ДатаНачала", НачалоМесяца(ДокументСсылкаВводПоказанийПриборовВоды.ПериодНачисления));
		Запрос.УстановитьПараметр("ДатаОкончания", КонецМесяца(ДокументСсылкаВводПоказанийПриборовВоды.ПериодНачисления));
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			
			ДокументОбъектВводПоказанийПриборовВоды = ДокументСсылкаВводПоказанийПриборовВоды.ПолучитьОбъект();
			
			ВыборкаИзРезультатаЗапроса = РезультатЗапроса.Выбрать();
			ОСМДСервер.СообщитьОбОшибкахПроведенияПоПовторномуНачислению(ДокументОбъектВводПоказанийПриборовВоды, ВыборкаИзРезультатаЗапроса, Отказ);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
